blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order("created_at DESC")

UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "This is now an actual Post"], ["body", "Update is working correctly!"], ["updated_at", "2017-12-05 23:15:22.519129"], ["id", 3]]
---
  def update
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
  def destroy
    @post.destroy

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["body", "asldkjalsd;kfjl;q2e"], ["created_at", "2017-12-05 22:48:57.044521"], ["updated_at", "2017-12-05 22:48:57.044521"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find(params[:id])